# HideReferencePlane Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions..::..HideReferencePlane Property
PDFExportOptions Class See Also
---
Whether to hide reference/work planes.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public bool HideReferencePlane { get; set; }
```

Visual Basic
---
```text
Public Property HideReferencePlane As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool HideReferencePlane {
	bool get ();
	void set (bool value);
}
```

# See Also
PDFExportOptions Class
Autodesk.Revit.DB Namespace